Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ཀྱི་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་ཏེ། གང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ནོ། །ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་།
en: Just as the real nature, the unmistaken real nature, the one and only real nature, reality, the realm of phenomena, the abiding nature of reality, maturity with respect to all phenomena, the very limit of reality, and the inconceivable realm are not included within the realm of desire, the realm of form, or the realm of formlessness, that which is not included in them is neither past, nor future, nor present.

source: རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་། མི་ཉམ་པའི་ཆོས་ཉིད་དང་། རྟག་ཏུ་བཏང་སྙོམས་སུ་གནས་པ་གང་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་
en: Just as ethical discipline, meditative stability, wisdom, liberation, seeing the wisdom of liberation, all-aspect omniscience, unimpaired reality, and the abiding in perpetual equanimity are not included within the realm of desire, the realm of form, or the realm of formlessness, that which is not included in them is neither past, nor future, nor present.

source: མེད་པའི་ཁམས་ཀྱི་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་ཏེ། གང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེ་ནི་ཁོངས་སུ་མ་ཆུད་པའི་ཕྱིར་ཏེ། དེ་བཞིན་དུ་ཡོངས་སུ་བསྔོ་བ་ཡང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་ཏེ།
en: If you ask why, it is like this: Since these are not included [in the three realms], likewise, the dedication also is not included in them and that which is not included in them is neither past, nor future, nor present.

source: གང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ནོ། །ཆོས་གང་ལ་ཡོངས་སུ་བསྔོ་བའི་ཆོས་དེ་ཡང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་ཏེ། གང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན།
en: The phenomena to which the dedication is made are also not included in them and that which is not included in them is neither past, nor future, nor present.

source: མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ནོ། །གང་ཡོངས་སུ་བསྔོ་བ་དེ་ཡང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་ཏེ། གང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན།
en: The phenomena that are dedicated are also not included in them and that which is not included in them is neither past, nor future, nor present.

source: ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ནོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་ཏེ། གང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན།
en: The lord buddhas are also not included in them and that which is not included in them is neither past, nor future, nor present.

source: ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ནོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་ཏེ། གང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན་མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ནོ།
en: The roots of virtuous action that those lord buddhas have are also not included in them and that which is not included in them is neither past, nor future, nor present.

source: །ཉན་ཐོས་དེ་དག་དང་། རང་སངས་རྒྱས་དེ་དག་ཀྱང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན། དེ་དག་གིས་དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་ཏེ། གང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན།
en: The śrāvakas and the pratyekabuddhas are also not included in them, nor are their roots of virtuous action included in them, and that which is not included in them is neither past, nor future, nor present. “

source: ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ནོ། །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ།
en: When bodhisattva great beings practice the perfection of wisdom, {Ki.

source: དེ་ལྟར་གཟུགས་གང་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ཀྱི་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན་ནོ། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ཏེ། དེ་ནི་མཚན་མའི་ཚུལ་ལམ། དམིགས་པའི་ཚུལ་གྱིས་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ།
en: II-III: 135} the physical forms that are not included within the realm of desire, the realm of form, or the realm of formlessness are neither past, nor future, nor present, and these cannot be dedicated by way of a distinguishing mark or by way of apprehending.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ལ་རང་བཞིན་མེད་དོ།
en: If you ask why, it is because they are without inherent existence.

source: །གང་ལ་རང་བཞིན་མེད་པ་དེ་ནི་དངོས་པོ་མེད་པ་སྟེ། དངོས་པོ་མེད་པ་ནི་དངོས་པོ་མེད་པས་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་།
en: That which is without inherent existence is a nonentity, and it is impossible to dedicate a nonentity by means of a nonentity.

source: རྣམ་པར་ཤེས་པ་གང་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ཀྱི་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ཏེ། དེ་ནི་མཚན་མའི་ཚུལ་ལམ། དམིགས་པའི་ཚུལ་གྱིས་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ།
en: The feelings, perceptions, formative predispositions, and consciousness that are not included within the realm of desire, the realm of form, or the realm of formlessness are neither past, nor future, nor present, and these cannot be dedicated by way of a distinguishing mark or by way of apprehending.

source: །གང་ལ་རང་བཞིན་མེད་པ་དེ་ནི་དངོས་པོ་མེད་པ་སྟེ། དངོས་པོ་མེད་པ་ནི་དངོས་པོ་མེད་པས་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ། །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་། མི་ཉམ་པའི་ཆོས་ཉིད་དང་།
en: That which is without inherent existence is a nonentity, and it is impossible to dedicate a nonentity by means of a nonentity.

source: རྟག་ཏུ་བཏང་སྙོམས་སུ་གནས་པ་གང་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ཀྱི་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ཏེ། དེ་ནི་མཚན་མའི་ཚུལ་ལམ། དམིགས་པའི་ཚུལ་གྱིས་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ།
en: The sense fields, the sensory elements, the links of dependent origination, the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, the perfection of wisdom, the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of external and internal phenomena, the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas, knowledge of all the dharmas, knowledge of the path, all-aspect omniscience, unimpaired reality, and the abiding in perpetual equanimity that are not included within the realm of desire, the realm of form, or the realm of formlessness are neither past, nor future, nor present, and these cannot be dedicated by way of a distinguishing mark or by way of apprehending.

source: །གང་ལ་རང་བཞིན་མེད་པ་དེ་ནི་དངོས་པོ་མེད་པ་སྟེ། དངོས་པོ་མེད་པ་ནི་དངོས་པོ་མེད་པས་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ་ཞེས།
en: That which is without inherent existence is a nonentity, and it is impossible to dedicate a nonentity by means of a nonentity.

source: དེ་ལྟར་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བསྔོ་བ་ལ་དུག་མེད་པ་ཡིན་ཏེ།
en: If they know this, bodhisattva great beings will make their dedication and it will be nonpoisonous.

source: བདུད་རྩིའི་མཐར་ཕྱིན་པར་འགྱུར་རོ།
en: It will have the perfection of nectar. “

source: །བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་མཚན་མའི་ཚུལ་ལམ། དམིགས་པའི་ཚུལ་གྱིས་དགེ་བའི་རྩ་བ་དེ་དག་ཡོངས་སུ་བསྔོ་ན། དེ་ནི་ལོག་པར་ཡོངས་སུ་བསྔོ་བ་ཡིན་གྱི་ཡང་དག་པར་ཡོངས་སུ་བསྔོ་བ་མ་ཡིན་ནོ།
en: If the noble sons or noble daughters who follow the vehicle of the bodhisattvas were to dedicate those roots of virtuous action by way of a distinguishing mark or by way of apprehending, then the dedication would be wrongly made, and it would not be genuinely made.

source: །ལོག་པར་ཡོངས་སུ་བསྔོ་བ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་མི་བསྔགས་པ་ཡིན་ཏེ།
en: Dedications that are wrongly made are not praised by the lord buddhas.

source: གང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་མ་བསྔགས་པའི་ཡོངས་སུ་བསྔོ་བ་དེས་ནི། དེའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་མི་འགྱུར་རོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Through dedications that are not praised by the lord buddhas they will not complete the perfection of generosity.

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་མི་འགྱུར་རོ། །ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་།
en: They will not complete the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.

source: གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་མི་འགྱུར་རོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་སུམ་ཅུ་བདུན་པ།
en: They will not complete the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of external and internal phenomena, the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, or the eighteen distinct qualities of the buddhas. “

source: ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་མི་འགྱུར་བ་དང་། ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་།
en: Those who do not complete the six perfections and who do not complete the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of external and internal phenomena, the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, or the eighteen distinct qualities of the buddhas will not refine the buddhafields, and they will not bring beings to maturity. {

source: མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། །སོ་སོ་ཡང་དག་པ་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་མི་འགྱུར་བ་དེས་ནི།
en: Ki.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་མི་འགྱུར། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་མི་འགྱུར་རོ། །གང་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་མ་གྱུར་པ་དང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་མ་གྱུར་པ་དེ་ནི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་འགྱུར་རོ།
en: II-III: 136} Those who have not refined the buddhafields and brought beings to maturity will not attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ལྟར་ཡོངས་སུ་བསྔོ་བ་དེ་ནི་དུག་དང་བཅས་པའི་ཕྱིར་རོ།
en: If you ask why, it is because their dedications are poisonous. “

source: །གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཇི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཆོས་ཉིད་འདིས་དགེ་བའི་རྩ་བ་དེ་དག་ཡོངས་སུ་བསྔོ་བར་བྱ་སྟེ། དེ་ལྟར་ཡོངས་སུ་བསྔོས་ནས་ཡོངས་སུ་བསྔོ་བའི་རབ་ཏུ་འགྱུར་རོ་ཞེས་བྱ་བར་ཐུགས་སུ་ཆུད་པ་དེ་བཞིན་དུ་བདག་གིས་ཀྱང་ཆོས་ཉིད་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བྱའོ་ཞེས་ཡོངས་སུ་བརྟག་པར་བྱའོ།
en: Moreover, when bodhisattva great beings practice the perfection of wisdom, they should think as follows: ‘Just as the lord buddhas comprehend that those roots of virtuous action should be dedicated on the basis of this reality, and that once the dedication has been made in that manner they will be excellently dedicated, similarly, I too should dedicate them on the basis of this reality to unsurpassed, complete enlightenment.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་བཀའ་སྩལ་པ། རབ་འབྱོར་ལེགས་སོ།
en: Then the Blessed One said to the venerable Subhūti, “Excellent, Subhūti!

source: །རབ་འབྱོར་དེ་ལྟར་ཁྱོད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཡོངས་སུ་བསྔོ་བའི་ཕུང་པོ་མཚན་མ་མེད་པའི་ཚུལ་དང་། དམིགས་པའི་མེད་པའི་ཚུལ་དང་། སྐྱེ་བ་མེད་པའི་ཚུལ་དང་། འགགས་པ་མེད་པའི་ཚུལ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པའི་ཚུལ་དང་། རྣམ་པར་བྱང་བ་མེད་པའི་ཚུལ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཚུལ་དང་། རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཚུལ་དང་། ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཚུལ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་དང་། དེ་བཞིན་ཉིད་ཀྱི་ཚུལ་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་ཀྱི་ཚུལ་གྱིས་སྟོན་པ་ནི། རབ་འབྱོར་ཁྱོད་སྟོན་པའི་བྱ་བ་བྱེད་པ་ཡིན་ནོ།
en: Subhūti, you, as you thus teach the mass of dedications that bodhisattva great beings make by way of signlessness, by way of nonapprehension, by way of nonarising, by way of nonceasing, by way of nonaffliction, by way of nonpurification, by way of the essential nature of nonentity, by way of the realm of phenomena, by way of the real nature, and by way of the one and only nature, you, Subhūti, are acting as the Teacher. “

source: །རབ་འབྱོར་གལ་ཏེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཐོབ་པར་གྱུར། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་ཐོབ་པར་གྱུར་ན། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། སེམས་ཅན་དེ་དག་གིས་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: Subhūti, if all beings of this great trichiliocosm were to obtain the paths of the ten virtuous actions, and if they were to obtain the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, and the five extrasensory powers, do you think, Subhūti, that those beings would increase their merit on that basis?” “

source: བདེ་བར་གཤེགས་པ་མང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Sugata, they would!”

source: རབ་འབྱོར་དེ་བས་ཀྱང་། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་དགེ་བའི་རྩ་བ་རྣམས་ཆགས་པ་མེད་པར་ཡོངས་སུ་བསྔོ་བས་ཡོངས་སུ་བསྔོས་པའི་བསོད་ནམས་ནི་ཆེས་མང་དུ་འཕེལ་ལོ། །རབ་འབྱོར་དེ་ལྟར་ན་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྔོ་བ་དེ་ནི་རབ་ཞེས་བྱའོ། །གཙོ་བོ་ཞེས་བྱའོ། །དམ་པ་ཞེས་བྱའོ།
en: The Blessed One continued, “Noble sons or noble daughters who dedicate the roots of virtuous action without attachment will increase the merit of their dedication to a much greater extent.

source: །ཕུལ་ཞེས་བྱའོ། །མཆོག་ཅེས་བྱའོ། །གྱ་ནོམ་པ་ཞེས་བྱའོ། །བླ་ན་མེད་པ་ཞེས་བྱའོ། །གོང་ན་མེད་པ་ཞེས་བྱའོ། །རབ་འབྱོར་གཞན་ཡང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན། སེམས་ཅན་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་རྒྱུན་ཏུ་ཞུགས་པར་གྱུར། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པར་གྱུར་ཏེ། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས། སེམས་ཅན་རྒྱུན་ཏུ་ཞུགས་པར་གྱུར་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་།
en: So it is, Subhūti, that this dedication of the roots of virtuous action that noble sons or noble daughters make is said to be the best; it is said to be foremost, it is said to be sacred, it is said to be perfect, it is said to be supreme, it is said to be sublime, it is said to be unsurpassed, and it is said to be highest. “

source: དགྲ་བཅོམ་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ལ་ནམ་འཚོའི་བར་དུ་གོས་དང་། བསོད་སྙོམས་དང་། མལ་ཆ་དང་ནད་ཀྱི་རྐྱེན་རྩི་དང་། ཡོ་བྱད་མང་པོས་རིམ་གྲོར་བྱས། བཀུར་སྟིར་བྱས།
en: Moreover, Subhūti, if all the beings in this great trichiliocosm, as many as there are, were to become those entering the stream to nirvāṇa, those destined for only one more rebirth, those no longer subject to rebirth, or arhats, and if some noble sons or noble daughters for the duration of their lives were to serve, respect, honor, and worship all those who are entering the stream to nirvāṇa, who are destined for only one more rebirth, who are no longer subject to rebirth, and who are arhats with clothing, alms, bedding, medicines for the treatment of disease, and many resources, do you think, Subhūti, that the merit of those noble sons or noble daughters would increase manifold on that basis?” “

source: བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་ན།
en: It would, Blessed Lord!

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: It would, Sugata!” {

source: བཅོམ་ལྡན་འདས་མང་ངོ་། །བདེ་བར་གཤེགས་པ་མང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བས་ཀྱང་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་དགེ་བའི་རྩ་བ་རྣམས་ཆགས་པ་མེད་པར་ཡོངས་སུ་བསྔོ་བས། ཡོངས་སུ་བསྔོ་བའི་བསོད་ནམས་ནི་ཆེས་མང་དུ་འཕེལ་ལོ།
en: II-III: 137} The Blessed One continued, “Subhūti, the merit dedicated by noble sons or noble daughters who dedicate the roots of virtuous action without attachment would increase manifold to a greater extent!

source: །རབ་འབྱོར་དེ་ལྟར་ན་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེའི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྔོ་བ་དེ་ནི་རབ་ཅེས་བྱའོ། །གཙོ་བོ་ཞེས་བྱའོ། །དམ་པ་ཞེས་བྱའོ། །ཕུལ་ཞེས་བྱའོ། །མཆོག་ཅེས་བྱའོ། །གྱ་ནོམ་པ་ཞེས་བྱའོ། །བླ་ན་མེད་པ་ཞེས་བྱའོ། །གོང་ན་མེད་པ་ཞེས་བྱའོ།
en: So it is, Subhūti, that this dedication of the roots of virtuous action that noble sons or noble daughters make is said to be the best; it is said to be foremost, it is said to be sacred, it is said to be perfect, it is said to be supreme, it is said to be sublime, it is said to be unsurpassed, and it is said to be highest. “

source: །རབ་འབྱོར་གཞན་ཡང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། སེམས་ཅན་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་རང་སངས་རྒྱས་སུ་གྱུར་ཏེ། དེ་ལ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས་གོས་དང་། བསོད་སྙོམས་དང་མལ་ཆ་དང་ནད་ཀྱི་རྐྱེན་རྩི་དང་། ཡོ་བྱད་མང་པོས་རིམ་གྲོར་བྱས། བཀུར་སྟིར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་ན། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: Moreover, Subhūti, if all the beings in this great trichiliocosm, as many as there are, were to become pratyekabuddhas, and if some noble sons or noble daughters were to serve, respect, honor, and worship them with clothing, alms, bedding, medicines and many resources, do you think, Subhūti, that the merit of those noble sons or noble daughters would increase manifold on that basis?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བས་ཀྱང་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་དགེ་བའི་རྩ་བ་རྣམས་ཆགས་པ་མེད་པའི་ཡོངས་སུ་བསྔོ་བས་ཡོངས་སུ་བསྔོ་བ་དེའི་བསོད་ནམས་ནི་ཆེས་མང་དུ་འཕེལ་ལོ། །རབ་འབྱོར་དེ་ལྟར་ན་རིགས་ཀྱི་བུའམ།
en: The Blessed One continued, “Subhūti, the merit dedicated by noble sons or noble daughters who dedicate the roots of virtuous action without attachment would increase manifold to a greater extent!

source: རིགས་ཀྱི་བུ་མོ་དེའི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྔོ་བ་དེ་ནི་རབ་ཅེས་བྱའོ། །གཙོ་བོ་ཞེས་བྱའོ། དམ་པ་ཞེས་བྱའོ། ཕུལ་ཞེས་བྱའོ། མཆོག་ཅེས་བྱའོ། གྱ་ནོམ་པ་ཞེས་བྱའོ། བླ་ན་མེད་པ་ཞེས་བྱའོ། གོང་ན་མེད་པ་ཞེས་བྱའོ། །རབ་འབྱོར་གཞན་ཡང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། སེམས་ཅན་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པར་གྱུར་ཏེ། དེ་ལ་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ན། སེམས་ཅན་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས།
en: So it is, Subhūti, that this dedication of the roots of virtuous action that noble sons or noble daughters make is said to be the best; it is said to be foremost, it is said to be sacred, it is said to be perfect, it is said to be supreme, it is said to be sublime, it is said to be unsurpassed, and it is said to be highest. “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རེ་རེ་ལ་ཡང་གོས་དང་། བསོད་སྙོམས་དང་། མལ་ཆ་དང་། ནད་ཀྱི་རྐྱེན་རྩི་དང་། ཡོ་བྱད་མང་པོས་བསྐལ་པ་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་རིམ་གྲོར་བྱས། བཀུར་སྟིར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་ཏེ། བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་པ་དང་། ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་འོག་དང་སྟེང་གི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ན། སེམས་ཅན་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རེ་རེ་ལ་ཡང་
en: Moreover, Subhūti, if all the beings in this great trichiliocosm, as many as there are, were to attain unsurpassed, complete enlightenment, and if all those beings, as many as there are, in the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, were to serve, respect, honor, and worship a single bodhisattva great being for eons as numerous as the grains of sand of the river Gaṅgā with clothing, alms, bedding, medicines for the treatment of disease, and many resources, venerating them with all sorts of comforts—and if all those beings, as many as there are, in the world systems of each of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, were to serve, respect, honor, and worship a single bodhisattva great being, for eons as numerous as the grains of sand of the river Gaṅgā, with clothing, alms, bedding, medicines for the treatment of disease, and many resources, venerating them with all sorts of comforts—do you think, Subhūti, that the merit of those noble sons or noble daughters would increase manifold on that basis?” “

source: གོས་དང་། བསོད་སྙོམས་དང་། མལ་ཆ་དང་། ནད་ཀྱི་རྐྱེན་རྩི་དང་། ཡོ་བྱད་མང་པོས་བསྐལ་པ་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་རིམ་གྲོར་བྱས། བཀུར་སྟིར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་ཏེ། བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་ན། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ། གསོལ་པ། བཅོམ་ལྡན་འདས་མང་ངོ་།
en: It would, Blessed Lord!

source: །བཅོམ་ལྡན་འདས་དེ་ནི་ཚད་མ་མ་མཆིས། གྲངས་མ་མཆིས། དཔག་ཏུ་མ་མཆིས་ཏེ།
en: Blessed Lord, it would be immeasurable, incalculable, and inestimable!
